OpenPuya/PY32T020_Firmware/Drivers/PY32T020_HAL_Driver/Inc/py32t020_hal_comp.h
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup COMP_Exported_Constants COMP Exported Constants
  * @{
  */

/** @defgroup COMP_Error_Code COMP Error Code
  * @{
  */
#define HAL_COMP_ERROR_NONE             (0x00UL)  /*!< No error */
#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
#define HAL_COMP_ERROR_INVALID_CALLBACK (0x01UL)  /*!< Invalid Callback error */
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup COMP_WindowMode COMP Window Mode
  * @{
  */
#define COMP_WINDOWMODE_DISABLE                 (0x00000000UL)         /*!< Window mode disable: Comparators instances pair COMP1 and COMP2 are independent */
#define COMP_WINDOWMODE_COMP2_INPUT_PLUS_COMMON (COMP_CSR_WINMODE | COMP_WINDOWMODE_COMP2) /*!< Window mode enable: Comparators instances pair COMP1 and COMP2 have their input plus connected together. The common input is COMP2 input plus (COMP1 input plus is no more accessible). */
/**
  * @}
  */

/** @defgroup COMP_PowerMode COMP power mode
  * @{
  *
  * Note: For the characteristics of comparator power modes                   
  *       (propagation delay and power consumption),                          
  *       refer to device datasheet.                                           */
#define COMP_POWERMODE_HIGHSPEED       (0x00000000UL)         /*!< High Speed */
#define COMP_POWERMODE_MEDIUMSPEED     (COMP_CSR_PWRMODE)     /*!< Medium Speed */
/**
  * @} 
  */   

/** @defgroup COMP_InputPlus COMP input plus (non-inverting input)
  * @{
  */ 
#define COMP_INPUT_PLUS_IO1       (0x00000000UL)                        /*!< Comparator input plus connected to IO1 (pin PA1 for COMP1, pin PA3 for COMP2) */
#define COMP_INPUT_PLUS_IO2       (COMP_CSR_INPSEL_0)                   /*!< Comparator input plus connected to IO2 (pin PB2 for COMP1, pin PA4 for COMP2) */
#define COMP_INPUT_PLUS_IO3       (COMP_CSR_INPSEL_1)                   /*!< Comparator input plus connected to IO3 (VREFCMP for COMP1, pin PA5 for COMP2) */
#define COMP_INPUT_PLUS_IO4       (COMP_CSR_INPSEL_1|COMP_CSR_INPSEL_0) /*!< Comparator input plus connected to IO4 (Reserved for COMP1,VREFCMP for COMP2) */
/**
  * @} 
  */   

/** @defgroup COMP_InputMinus COMP input minus (inverting input)
  * @{
  */
#define COMP_INPUT_MINUS_IO1       (0x00000000UL)                        /*!< Comparator input minus connected to IO1 (pin PA0 for COMP1, pin PA2 for COMP2) */
#define COMP_INPUT_MINUS_IO2       (COMP_CSR_INMSEL_0)                   /*!< Comparator input minus connected to IO2 (pin PB1 for COMP1, pin PB3 for COMP2) */
#define COMP_INPUT_MINUS_IO3       (COMP_CSR_INMSEL_1)                   /*!< Comparator input minus connected to IO3 (TSVIN for COMP1, Reserved for COMP2) */
/**
  * @} 
  */   
  
/** @defgroup COMP_VrefSrc COMP Vref Source
  * @{
  */

#define COMP_VREFCMP_SOURCE_VCC           (COMP_CSR_COMP_VCSEL)
#define COMP_VREFCMP_SOURCE_VREFBUF0P6V   (ADC_CCR_VREFBUF_EN )
#define COMP_VREFCMP_SOURCE_VREFBUF1P5V   (ADC_CCR_VREFBUF_EN | ADC_CCR_VREFBUF_SEL_0 )
#define COMP_VREFCMP_SOURCE_VREFBUF2P048V (ADC_CCR_VREFBUF_EN | ADC_CCR_VREFBUF_SEL_1 )
#define COMP_VREFCMP_SOURCE_VREFBUF2P5V   (ADC_CCR_VREFBUF_EN | ADC_CCR_VREFBUF_SEL_1 | ADC_CCR_VREFBUF_SEL_0)
/**
  * @} 
  */   

/** @defgroup COMP_OutputPolarity COMP output Polarity
  * @{
  */
#define COMP_OUTPUTPOL_NONINVERTED     (0x00000000UL)         /*!< COMP output level is not inverted (comparator output is high when the input plus is at a higher voltage than the input minus) */
#define COMP_OUTPUTPOL_INVERTED        (COMP_CSR_POLARITY)    /*!< COMP output level is inverted     (comparator output is low  when the input plus is at a higher voltage than the input minus) */
/**
  * @}
  */

/** @defgroup COMP_VrefDiv COMP VREFCMP Div
  * @{
  */  
#define COMP_VREFCMP_DISABLE            (0x00000000UL)      
#define COMP_VREFCMP_DIV_1_64VREFCMP    (COMP_CSR_COMP_VCDIV_EN)  
#define COMP_VREFCMP_DIV_2_64VREFCMP    (COMP_CSR_COMP_VCDIV_EN |                                                                                                                          COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_3_64VREFCMP    (COMP_CSR_COMP_VCDIV_EN |                                                                                                  COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_4_64VREFCMP    (COMP_CSR_COMP_VCDIV_EN |                                                                                                  COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_5_64VREFCMP    (COMP_CSR_COMP_VCDIV_EN |                                                                          COMP_CSR_COMP_VCDIV_2                                                )
#define COMP_VREFCMP_DIV_6_64VREFCMP    (COMP_CSR_COMP_VCDIV_EN |                                                                          COMP_CSR_COMP_VCDIV_2                         | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_7_64VREFCMP    (COMP_CSR_COMP_VCDIV_EN |                                                                          COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_8_64VREFCMP    (COMP_CSR_COMP_VCDIV_EN |                                                                          COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_9_64VREFCMP    (COMP_CSR_COMP_VCDIV_EN |                                                  COMP_CSR_COMP_VCDIV_3                                                                        )
#define COMP_VREFCMP_DIV_10_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                                                  COMP_CSR_COMP_VCDIV_3                                                 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_11_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                                                  COMP_CSR_COMP_VCDIV_3                         | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_12_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                                                  COMP_CSR_COMP_VCDIV_3                         | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_13_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                                                  COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2                                                )
#define COMP_VREFCMP_DIV_14_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                                                  COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2                         | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_15_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                                                  COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_16_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                                                  COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_17_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4                                                                                                )
#define COMP_VREFCMP_DIV_18_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4                                                                         | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_19_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4                                                 | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_20_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4                                                 | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_21_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4                         | COMP_CSR_COMP_VCDIV_2                                                )
#define COMP_VREFCMP_DIV_22_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4                         | COMP_CSR_COMP_VCDIV_2                         | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_23_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4                         | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_24_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4                         | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_25_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3                                                                        )
#define COMP_VREFCMP_DIV_26_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3                                                 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_27_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3                         | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_28_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3                         | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_29_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2                                                )
#define COMP_VREFCMP_DIV_30_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2                         | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_31_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_32_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |                          COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_33_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                                                                                                                        )
#define COMP_VREFCMP_DIV_34_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                                                                                                 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_35_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                                                                         | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_36_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                                                                         | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_37_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                                                 | COMP_CSR_COMP_VCDIV_2                                                )
#define COMP_VREFCMP_DIV_38_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                                                 | COMP_CSR_COMP_VCDIV_2                         | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_39_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                                                 | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_40_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                                                 | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_41_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                         | COMP_CSR_COMP_VCDIV_3                                                                        )
#define COMP_VREFCMP_DIV_42_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                         | COMP_CSR_COMP_VCDIV_3                                                 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_43_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                         | COMP_CSR_COMP_VCDIV_3                         | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_44_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                         | COMP_CSR_COMP_VCDIV_3                         | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_45_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                         | COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2                                                )
#define COMP_VREFCMP_DIV_46_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                         | COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2                         | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_47_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                         | COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_48_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5                         | COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_49_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4                                                                                                )
#define COMP_VREFCMP_DIV_50_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4                                                                         | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_51_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4                                                 | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_52_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4                                                 | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_53_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4                         | COMP_CSR_COMP_VCDIV_2                                                )
#define COMP_VREFCMP_DIV_54_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4                         | COMP_CSR_COMP_VCDIV_2                         | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_55_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4                         | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_56_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4                         | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_57_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3                                                                        )
#define COMP_VREFCMP_DIV_58_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3                                                 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_59_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3                         | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_60_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3                         | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_61_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2                                                )
#define COMP_VREFCMP_DIV_62_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2                         | COMP_CSR_COMP_VCDIV_0)
#define COMP_VREFCMP_DIV_63_64VREFCMP   (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1                        )
#define COMP_VREFCMP_DIV_VREFCMP        (COMP_CSR_COMP_VCDIV_EN |  COMP_CSR_COMP_VCDIV_5 | COMP_CSR_COMP_VCDIV_4 | COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)

/**
  * @} 
  */   

/** @defgroup COMP_TIM_EXTI_Out_Sel COMP TIM EXTI Output Selection
  * @{
  */
#define COMP_TIM_EXTI_OUT_NOFILTER                 (0x00000000UL)                      /*!< The comparator output to TIM or EXTI is no filtered */
#define COMP_TIM_EXTI_OUT_FILTER                   (COMP_CSR_TIM_EXTI_OUT_SEL)         /*!< The comparator output to TIM or EXTI is filtered */
/**
  * @} 
  */    
  
